// Функции фозвращают замоканные данные
// использовались для отрисовки экранов
// до того как приложение научилось парсить 
// ответы с сервера

function getHospitalsMock() {
    return [
        {
            "MO_Id": "194701",
            "Reg_Phone": "(4242) 30-00-34",
            "Organization_Name": "ГБУЗ Городская поликлиника №2 г.Южно-Сахалинска",
            "Address_MO": "Южно-Сахалинск, пр-кт Мира, 85"
        },
        {
            "MO_Id": "194702",
            "Reg_Phone": "(4242) 70-50-91",
            "Organization_Name": "ГБУЗ Городская поликлиника №2 г.Южно-Сахалинска Дальнее",
            "Address_MO": "г.Южно-Сахалинск, с.Дальнее, ул.Новая, 20"
        },
        {
            "MO_Id": "1943",
            "Reg_Phone": "(4242) 72–21–09, (4242) 72–29–67",
            "Organization_Name": "Сахалинский областной центр по профилактике и борьбе со СПИД",
            "Address_MO": "Южно-Сахалинск, ул.Амурская, 53-А"
        },
        {
            "MO_Id": "9494",
            "Reg_Phone": "(4242) 510–710, (4242) 510–717, (4242) 510–718",
            "Organization_Name": "Сахалинский областной кожно-венерологический диспансер",
            "Address_MO": "Южно-Сахалинск, ул. Больничная, 46-Б"
        },
        {
            "MO_Id": "65111101",
            "Reg_Phone": "(4242) 72-84-99 - Регистратура",
            "Organization_Name": "Городская травматологическая поликлиника",
            "Address_MO": "Южно-Сахалинск, проспект Мира 56а/3"
        },
        {
            "MO_Id": "78963",
            "Reg_Phone": "(4242) 77-22-95 - Регистратура",
            "Organization_Name": "Областная психиатрическая больница. Медосмотры",
            "Address_MO": "Южно-Сахалинск, ул.Лермонтова, 110"
        },
        {
            "MO_Id": "74125",
            "Reg_Phone": "(4242) 76-08-82 - Регистратура",
            "Organization_Name": "Областной наркологический диспансер. Медосмотры",
            "Address_MO": "Южно-Сахалинск, ул.Горького, 12А"
        }
    ]
}

function getServicesMock() {
    return [
        {
            "Service_Id": "1",
            "Service_Name": "Врач-оториноларинголог"
        },
        {
            "Service_Id": "2",
            "Service_Name": "Врач-терапевт"
        },
        {
            "Service_Id": "3",
            "Service_Name": "Врач-стоматолог"
        },
    ]
}

function getResourcesMock() {
    return [
        {
            "Resource_Id": "10",
            "Resource_Name": "Хауз Грегори Михайлович"
        },
        {
            "Resource_Id": "20",
            "Resource_Name": "Робберт Чейз Иванович"
        },
        {
            "Resource_Id": "30",
            "Resource_Name": "Лиза Кадди Сергеевна"
        },
        {
            "Resource_Id": "40",
            "Resource_Name": "Эрик Форман Петрович"
        },
    ]
}

function getSlotsMock() {
    return [
        {
            "Slot_Id": "194701-78825-66165-60300-61200",
            "VisitTime": "2022-02-25T16:45:00.000"
        },
        {
            "Slot_Id": "194701-78825-66165-62100-63000",
            "VisitTime": "2022-02-25T17:15:00.000"
        },
        {
            "Slot_Id": "194701-78825-66165-63000-63900",
            "VisitTime": "2022-02-25T17:30:00.000"
        },
        {
            "Slot_Id": "194701-78825-66165-63900-64800",
            "VisitTime": "2022-02-25T17:45:00.000"
        },
        {
            "Slot_Id": "194701-78825-66165-64800-65700",
            "VisitTime": "2022-02-25T18:00:00.000"
        },
        {
            "Slot_Id": "194701-78825-66165-65700-66600",
            "VisitTime": "2022-02-25T18:15:00.000"
        },
        {
            "Slot_Id": "194701-78825-66168-58500-59400",
            "VisitTime": "2022-02-28T16:15:00.000"
        },
        {
            "Slot_Id": "194701-78825-66168-59400-60300",
            "VisitTime": "2022-02-28T16:30:00.000"
        },
        {
            "Slot_Id": "194701-78825-66168-60300-61200",
            "VisitTime": "2022-02-28T16:45:00.000"
        },
        {
            "Slot_Id": "194701-78825-66168-61200-62100",
            "VisitTime": "2022-02-28T17:00:00.000"
        },
        {
            "Slot_Id": "194701-78825-66168-62100-63000",
            "VisitTime": "2022-02-28T17:15:00.000"
        },
        {
            "Slot_Id": "194701-78825-66168-63900-64800",
            "VisitTime": "2022-02-28T17:45:00.000"
        },
        {
            "Slot_Id": "194701-78825-66168-64800-65700",
            "VisitTime": "2022-02-28T18:00:00.000"
        },
        {
            "Slot_Id": "194701-78825-66168-65700-66600",
            "VisitTime": "2022-02-28T18:15:00.000"
        },
        {
            "Slot_Id": "194701-78825-66169-57600-58500",
            "VisitTime": "2022-03-01T16:00:00.000"
        },
        {
            "Slot_Id": "194701-78825-66169-58500-59400",
            "VisitTime": "2022-03-01T16:15:00.000"
        },
        {
            "Slot_Id": "194701-78825-66169-59400-60300",
            "VisitTime": "2022-03-01T16:30:00.000"
        },
        {
            "Slot_Id": "194701-78825-66169-60300-61200",
            "VisitTime": "2022-03-01T16:45:00.000"
        },
        {
            "Slot_Id": "194701-78825-66169-61200-62100",
            "VisitTime": "2022-03-01T17:00:00.000"
        },
        {
            "Slot_Id": "194701-78825-66169-62100-63000",
            "VisitTime": "2022-03-01T17:15:00.000"
        },
        {
            "Slot_Id": "194701-78825-66169-63000-63900",
            "VisitTime": "2022-03-01T17:30:00.000"
        },
        {
            "Slot_Id": "194701-78825-66169-63900-64800",
            "VisitTime": "2022-03-01T17:45:00.000"
        },
        {
            "Slot_Id": "194701-78825-66169-64800-65700",
            "VisitTime": "2022-03-01T18:00:00.000"
        },
        {
            "Slot_Id": "194701-78825-66169-65700-66600",
            "VisitTime": "2022-03-01T18:15:00.000"
        },
        {
            "Slot_Id": "194701-78825-66170-57600-58500",
            "VisitTime": "2022-03-02T16:00:00.000"
        },
        {
            "Slot_Id": "194701-78825-66170-58500-59400",
            "VisitTime": "2022-03-02T16:15:00.000"
        },
        {
            "Slot_Id": "194701-78825-66170-59400-60300",
            "VisitTime": "2022-03-02T16:30:00.000"
        },
        {
            "Slot_Id": "194701-78825-66170-60300-61200",
            "VisitTime": "2022-03-02T16:45:00.000"
        },
        {
            "Slot_Id": "194701-78825-66170-61200-62100",
            "VisitTime": "2022-03-02T17:00:00.000"
        },
        {
            "Slot_Id": "194701-78825-66170-62100-63000",
            "VisitTime": "2022-03-02T17:15:00.000"
        },
        {
            "Slot_Id": "194701-78825-66170-63000-63900",
            "VisitTime": "2022-03-02T17:30:00.000"
        },
        {
            "Slot_Id": "194701-78825-66170-63900-64800",
            "VisitTime": "2022-03-02T17:45:00.000"
        },
        {
            "Slot_Id": "194701-78825-66170-64800-65700",
            "VisitTime": "2022-03-02T18:00:00.000"
        },
        {
            "Slot_Id": "194701-78825-66170-65700-66600",
            "VisitTime": "2022-03-02T18:15:00.000"
        },
        {
            "Slot_Id": "194701-78825-66171-57600-58500",
            "VisitTime": "2022-03-03T16:00:00.000"
        },
        {
            "Slot_Id": "194701-78825-66171-58500-59400",
            "VisitTime": "2022-03-03T16:15:00.000"
        },
        {
            "Slot_Id": "194701-78825-66171-59400-60300",
            "VisitTime": "2022-03-03T16:30:00.000"
        },
        {
            "Slot_Id": "194701-78825-66171-60300-61200",
            "VisitTime": "2022-03-03T16:45:00.000"
        },
        {
            "Slot_Id": "194701-78825-66171-61200-62100",
            "VisitTime": "2022-03-03T17:00:00.000"
        },
        {
            "Slot_Id": "194701-78825-66171-62100-63000",
            "VisitTime": "2022-03-03T17:15:00.000"
        },
        {
            "Slot_Id": "194701-78825-66171-63000-63900",
            "VisitTime": "2022-03-03T17:30:00.000"
        },
        {
            "Slot_Id": "194701-78825-66171-63900-64800",
            "VisitTime": "2022-03-03T17:45:00.000"
        },
        {
            "Slot_Id": "194701-78825-66171-64800-65700",
            "VisitTime": "2022-03-03T18:00:00.000"
        },
        {
            "Slot_Id": "194701-78825-66171-65700-66600",
            "VisitTime": "2022-03-03T18:15:00.000"
        },
        {
            "Slot_Id": "194701-78825-66172-57600-58500",
            "VisitTime": "2022-03-04T16:00:00.000"
        },
        {
            "Slot_Id": "194701-78825-66172-58500-59400",
            "VisitTime": "2022-03-04T16:15:00.000"
        },
        {
            "Slot_Id": "194701-78825-66172-59400-60300",
            "VisitTime": "2022-03-04T16:30:00.000"
        },
        {
            "Slot_Id": "194701-78825-66172-60300-61200",
            "VisitTime": "2022-03-04T16:45:00.000"
        },
        {
            "Slot_Id": "194701-78825-66172-61200-62100",
            "VisitTime": "2022-03-04T17:00:00.000"
        },
        {
            "Slot_Id": "194701-78825-66172-62100-63000",
            "VisitTime": "2022-03-04T17:15:00.000"
        },
        {
            "Slot_Id": "194701-78825-66172-63000-63900",
            "VisitTime": "2022-03-04T17:30:00.000"
        },
        {
            "Slot_Id": "194701-78825-66172-63900-64800",
            "VisitTime": "2022-03-04T17:45:00.000"
        },
        {
            "Slot_Id": "194701-78825-66172-64800-65700",
            "VisitTime": "2022-03-04T18:00:00.000"
        },
        {
            "Slot_Id": "194701-78825-66172-65700-66600",
            "VisitTime": "2022-03-04T18:15:00.000"
        }
    ].map( s => {
        s.VisitTime = new Date(s.VisitTime)
        return s
    })
}
